[
    {
        "id": "TEST-NARRATOR-001",
        "text": "Once upon a time, in the wobbly little village of Gigglebottom, lived two curious friends named Benny the Bear and Lulu the Rabbit. Benny loved honey sandwiches and Lulu adored carrot cupcakes, and both loved adventure! One bright, sunny morning, Benny and Lulu found a mysterious map hidden inside Benny’s honey jar. The map promised treasure beyond the Gigglebottom Forest! Adventure awaits! Benny roared excitedly. And maybe cupcakes! Lulu squealed, hopping up and down. The two friends packed snacks (lots of snacks!) and headed toward Gigglebottom Forest. The forest was full of silly surprises—trees that giggled when tickled, rocks that sang silly songs, and rivers that flowed with fizzy lemonade. As they hopped and bounded through the funny forest, Benny tripped over a giggling rock and rolled straight into a bush of feathers, turning him into a fluffy bear-bird! Look, Benny, you're flying! Lulu laughed, watching Benny float into the air, covered in feathers. Ahhh, catch me, Lulu! Benny cried, flapping his arms. After a fluffy crash landing, they discovered they'd reached the spot marked X on the map. But instead of gold or jewels, the treasure was a giant cupcake guarded by a sleepy dragon named Snore-a-lot. Zzzz...who dares awaken me from my nap? Snore-a-lot grumbled sleepily. Sorry, Mr. Dragon, Benny whispered politely. We thought the cupcake might be treasure. It is treasure, yawned Snore-a-lot, but I baked it to share. Want a slice? Together, Benny, Lulu, and Snore-a-lot had a wonderful cupcake picnic, laughing and munching happily. When the sun began to set, Benny and Lulu waved goodbye to their new dragon friend and headed home, bellies full and hearts happy. That night, as they tucked into bed, Lulu giggled, Today's adventure was sweet and silly! Yes, Benny smiled sleepily, and tomorrow will be even sweeter! And with dreams of giggling trees, fluffy flights, and cupcake treasures, they drifted happily off to sleep."
    }
    
]